//类型转换练习
#include<stdio.h>
/*int main()
{
//算术运算类：字符to整型to实型，短型to长型，无符号to有符号
	int num1 = 0 ;
	double num2 = 0;
	num1 = 7 / 2 + 4 * 2.25 + 'A' / 5;
	num2 = 7.0 / 2+ 4 * 2.25 + 'A' / 5;	//计算过程中，会把2转换为实型
	printf("%d\n%.1lf\n", num1, num2);
//赋值类型转换
	unsigned short a = 32768;
	short b = 0;
		b = a;
		printf("%d\n", b);	//a=1000 0000 0000 0000		b=1000 0000 0000 0000  此时b有符号位，为负数
//赋值转换时，会直接把补码给对方，对方按照规则得到源码，再找到对应的数字
//长整型向短整型转换时，会只保留后面的十六位，导致精度丢失
		int c = 98305;
		short d = 0;
		d= c;
		printf("%d\n", d);		//98305=0000 0000 0000 0001 1000 0000 0000 0001	
								//转换时只保留后面的十六位，1000 0000 0000 0001
								//再取对应的源码1111 1111 1111 1111

}*/